{
  "recipes": [
    {
      "id": 1,
      "name": "Spicy Ahi Poke",
      "image": "spicyahipoke.png",
      "likes": 6000,
      "Ingredients": "1 pound yellowfin tuna steak, sushi or sashimi grade (fresh or flash frozen) \n 1 tablespoon soy sauce, to taste \n one half tablespoon sesame oil, to taste \n 2 scallions, chopped finely \n one quarter onion, sliced (optional) \n two tablespoons mayonnaise or Japanese mayonnaise \n two tablespoons Sriracha sauce, or to taste \n two teaspoons tobiko or masago (optional)",
      "directions": "If tuna is frozen, thaw by submerging in room temperature water for 30 minutes. \n When tuna is just short of fully thawed, slice into small cubes, around 1 inch. You could do larger or smaller, whatever you prefer. I tend to go a bit smaller for more flavor.\nCombine in a bowl with 1 tablespoon soy sauce, 1/2 tablespoon sesame oil, and 1 chopped scallion. I don't really measure the soy sauce or sesame oil, but use whatever is enough to coat the tuna thinly. Chill in fridge for about 30 minutes.\nCombine mayo, Sriracha, remaining scallions (reserving a bit for topping), and 1 tablespoon tobiko or masago, whisking briefly until combined. When tuna is chilled, add the spicy mayo and mix gently until fully coated. I just get right in there and use my hands. :)\nTop with a bit more tobiko and scallions, and serve! The poke will be good for up to one day, but is best eaten fresh.",
      "source": "http://tworedbowls.com/2013/06/17/spicy-ahi-poke/"
    },
    {
      "id": 2,
      "name": "ROASTED PUMPKIN, FETA AND QUINOA SALAD",
      "image": "quinoasalad.png",
      "likes": 700,
      "Ingredients": "2 CUPS (400G) QUINOA\n1KG JAP PUMPKIN, CUT INTO WEDGES\n2 TABLESPOONS OLIVE OIL\n1 RED ONION, CUT INTO WEDGES\n¼ CUP (60ML) WHITE WINE VINEGAR\n2 TEASPOONS CASTER (SUPERFINE) SUGAR\n⅓ CUP CHOPPED CORIANDER (CILANTRO) LEAVES\n1 X 400G CAN CHICKPEAS (GARBANZOS), DRAINED AND RINSED\nMARINATED FETA, CRUMBLED, TO SERVE",
      "directions": "Soak the quinoa in a saucepan with 3 cups (750ml) water for 15 minutes. Place the saucepan over high heat and bring to the boil. Reduce heat to low and cook, covered, for 15 minutes or until all the water is absorbed. Set aside.\nPreheat oven to 220°C (425°F). Place the pumpkin and half the oil on a baking tray and toss to coat. Roast for 10 minutes.\nAdd the onion and roast for a further 10–15 minutes or until pumpkin is tender. Mix to combine the vinegar, sugar, coriander, chickpeas and quinoa. Top with pumpkin, onion and feta to serve. Serves 4.",
      "source": "https://www.donnahay.com.au/recipes/2965-roast-sweet-potato-garlic-and-chicken/baked-salmon-with-radish-and-cucumber-salad/roasted-pumpkin-feta-and-quinoa-salad"
    },
    {
      "id": 3,
      "name": "Healthy Nutella",
      "image": "healthynutella.png",
      "likes": null,
      "Ingredients": "– 2 cups of hazelnuts (380g)\n– 1/2 a cup of maple syrup (125ml)\n– 3 tablespoons of raw cacao powder",
      "directions": "Method\nBake the hazelnuts at 180C for about ten minutes, then take them out of the oven and allow them to cool. I like to remove the skins, but you can leave this bit out if you don’t have time.\nOnce cool place them in a food processor and blend for about ten minutes, until they totally break down. Keep blending till a runny hazelnut butter forms, then pour this into a bowl. Slowly pour in the maple syrup, stirring continuously to combine. Then do the same with the cacao powder, adding one spoonful at a time, until a you have a thick, creamy nutella!",
      "source": "https://deliciouslyella.com/2013/05/18\nutritious-nutella-vegan-sugar-free/"
    },
    {
      "id": 4,
      "name": "Sea Urchin Pasta with Uni Miso Butter",
      "image": "unipasta.png",
      "likes": null,
      "Ingredients": "300g pasta\n1 tray fresh uni\n2 tablespoons butter, room temperature\n2 tablespoons olive oil\n1 tablespoon miso\n1 garlic clove, crushed\n1/4 cup cream\n1 egg (optional)\nTogarashi\nCrushed nori\nSalt",
      "directions": "1. Cook pasta in boiling salted water according to package directions.\n2. Combine butter, olive oil, miso, and 3/4 tray of uni in a bowl. Mash to combine. Stir in the crushed garlic and cream; add an egg if you prefer your sauce to be thicker. Sprinkle in togarashi to taste.\n3. When the pasta is al dente, drain quickly and return to the pot. Add the uni butter mixture and toss to incorporate with the warm pasta. Gently stir pasta and sauce together for 3 minutes over low heat.\n4. Portion the pasta onto two plates. Sprinkle with crushed nori and top it with the remaining whole sea urchin roe.",
      "source": "http://www.eatfish.ca/recipes/sea-urchin-pasta-uni-miso-butter"
    },
    {
      "id": 5,
      "name": "Sar's Eggs",
      "image": "sarseggs.png",
      "likes": 1,
      "Ingredients": "4 eggs (2 just yolks)\n2 slices of bread\n2 slices of prosciutto\n1/2 stick of butter\nlemon juice\nvinegar\nchives, salt, pepper",
      "directions": "To make the hollandaise: Do this first or while the eggs are poaching because it takes awhile to get it thick, and if you do it after, your eggs are going to be cold. Using a bowl and a pot, separate the yolks and egg whites from the other 2 eggs. There are a few ways to do this but I like to crack the eggs partially, open the shells so that the yolk is sitting in one and the white just falls out, and just toss the yolk back and forth until the rest of the white falls out. Do this over a bowl so that the whites fall into it and use the pot or a double boiler to store your yolk when you’re done. You can refrigerate the whites for later for an omelette or something. Set the yolks aside and take your butter in a different bowl and microwave for 30 seconds, or until it’s melted. Pour the butter in with the yolks and start whisking. You have to whisk consistently because the hot butter will scramble the yolk if it’s kept still. Add lemon and salt to taste as you go. Keep whisking, moving this pot either over a flame or over the boiling water that’s poaching your eggs. People say to be really careful with this because if you get the yolks too hot they’ll scramble, but I find it’s more that not stirring causes a scramble. Also if it’s not hot enough it takes way too long. Just don’t boil your sauce. Eventually your sauce will thicken, it’s up to preference how thick you want it. Sometimes I get lazy and leave it thin. It tastes the same either way. To poach the eggs: Bring a pot of water to boil. Add vinegar. I have no idea why, my mom tells me to do this, she says it does something to the white that’s important. Crack the first egg into a bowl. Stir the boiling water so that it’s moving in a circle. This way, the egg white will wrap around the yolk. Drop the egg carefully into the moving water. It’s ready when it floats and is no longer liquidy when you pick it up. Take the egg out with a slotted spoon to drain the water, set it aside in a bowl, and repeat with the second egg. Be careful not to break it or overcook the yolk, you want the yolk really runny so that when you cut into it it explodes everywhere. Toast or grill your bread however you want it. Sometimes I just have sliced bread instead of baguette so I cut the crust off and form it into a circle so it looks nice. Plate the bread, then put the meat, then the eggs, then distribute the hollandaise. Garnish with chives, salt etc.",
      "source": "meee"
    },
    {
      "id": 6,
      "name": "Gooey Butter Cake",
      "image": "buttercake.png",
      "likes": 2,
      "Ingredients": "1 package of vegan yellow cake mix (about 18oz)**\n1/2 cup House Foods Tofu, soft (replaces 1 egg)\n16 Tbsp vegan butter, melted (2 sticks of vegan butter)\n8oz vegan cream cheese\n1 cup House Foods Tofu, soft (replaces 2 eggs)\n1 tsp vanilla extract\n16 oz. organic powdered sugar (about 2 cups)",
      "directions": "Preheat oven to 350 degrees.  and grease your baking dish.\nCombine the cake mix, ½ cup soft tofu and 8 tablespoons of melted vegan butter (1 stick). Blend using a hand mixer. When mixture is moistened, dry and crumbly pour it into a lightly greased baking pan. Use your fingers or the back of a spoon to pat down the mixture a bit.  \nAdd the remaining melted vegan butter (1 stick), vegan cream cheese, 1 cup soft tofu, 1 tsp vanilla and 16oz powdered sugar to the large mixing bowl. (You do not need to rinse out the bowl.) Using the same mixer, beat until smooth.  \nPour this mixture over top the dry mixture in the pan.  \nBake for 40-50 minutes, or until the edges very lightly brown. Try not to over bake the cake if you want it nice and ‘gooey.’  \nWhen cake is ready, allow it to cool completely before slicing and serving. Chilling in the fridge for a few hours or overnight is even better. To serve: dust with powdered sugar. ",
      "source": "http://kblog.lunchboxbunch.com/2017/04/gooey-butter-cake-vegan.html"
    },
    {
      "id": 7,
      "name": "Matcha Cake",
      "image": "matchacake.png",
      "likes": 0,
      "Ingredients": " 1/3 cup white chocolate chips\n3 tbsp unsalted butter melted\n1/4 cup granulated white sugar\n1 large egg\n3 tbsp all purpose flour\n1 tbsp high quality matcha powder I use Maeda-En Ceremonial Quality\npowdered sugar for dusting",
      "directions": "Add white chocolate to a medium or large glass mixing bowl. Find a pot that is slightly smaller in diameter than your mixing bowl so that when you place the mixing bowl on top of the pot, the bowl will not touch the bottom of the pot. Add about 1 inch of water to your pot and bring to a simmer. Place bowl with chocolate on top. Slowly whisk chocolate until it is completely melted. This will take a few minutes.\nWhen chocolate is melted, turn off heat but keep your mixing bowl in the pot and on the stove. This will keep the batter warm. Add in melted butter and stir until butter is completely incorporated. Stir in sugar until smooth. Whisk in the egg until batter is smooth. Add in flour and whisk until smooth. Add in matcha powder and whisk again until smooth. Thoroughly grease the insides of two 4 oz ramekins with butter. Make sure you don't miss any spots, especially along the bottom of the ramekin, otherwise the cakes won't pop out properly. Lightly flour the inside of the ramekins. Turn ramekins upside down and hit a few times against counter so that any excess flour falls out.\nDivide batter evenly into the two ramekins. Place into freezer for 30 minutes.\nWhile freezing, preheat oven to 400°F. After 30 minutes in the freezer, place ramekins onto a baking sheet. Place into oven and bake about 14-16 minutes. Watch the cakes closely. You want the center to barely set (no longer liquid, but still slightly wobbly). Remove cakes and allow to cool and set for 10 minutes. Use a spatula and run around the edges of the cake to loosen the cake. Place a dessert plate, inverted, on top of ramekin. Pressing the plate on top of the ramekin (use gloves as the ramekin should still be quite hot), very carefully and quickly, turn over so that the plate is now at the bottom and the ramekin is upside down. (You need to do this in one fluid motion. Otherwise, the liquid lava filling will tumble out too quickly and break through the bottom layer of the cake.) Gently tap the upside down ramekin to ensure cake has popped into plate. Lift up ramekin. Dust with powdered sugar and serve.",
      "source": "https://kirbiecravings.com/matcha-green-tea-molten-lava-cakes"
    },
    {
      "id": 8,
      "name": "Red Velvet Cake",
      "image": "redvelvetcake.png",
      "likes": 2,
      "Ingredients": "Chocolate Crust\n1 cup almond flour\n2 Tbs  cocoa\n2 Tbs maple syrup\n2 Tbs refined coconut oil melted\nDash of pink salt\nRed Velvet 'Cheesecake'\n2 1/4 cup raw cashews soaked\n1 2/3 cup roasted beets\n1/2 cup + 1 Tbs maple syrup\n3/4 cup cocoa\n1 oz dark chocolate melted\n1 cup refined coconut oil melted\n1 1/4 Tbs  vanilla\n1/4 tsp almond extract\n1/8 tsp pink salt\n'Cream Cheese' Frosting\n1 cup raw cashews soaked\n1 Tbs  maple syrup\n2 1/2 tsp lemon juice\nSplash of vanilla\nDash of pink salt",
      "directions": "To make the crust:\nMix all ingredients together in a small bowl (sift cocoa first if clumpy). Add a splash of water if it's too dry.\nPress into a parchment-lined 7 springform pan. Chill while you make the filling.\nTo make the cheesecake:\nSoak cashews in a bowl of boiling water for 1-2 hours or overnight in room-temp water. Drain, rinse and shake dry.\nBlend cashews in a food processor for 3-5 minutes. Scrape down the sides. Add roasted beets and blend smooth.\nAdd remaining ingredients and blend. Taste and adjust if needed. Spread over crust. Cover pan with a paper towel and wrap in foil. Freeze for about 3 hours until solid, then refrigerate. To make the cream cheese:\nSoak cashews in a bowl of boiling water for 1-2 hours or overnight in room-temp water. Drain, rinse and shake dry.\nBlend cashews in a food processor for 3-5 minutes. Scrape down the sides. Add remaining ingredients, to taste and blend smooth.\nTransfer to a baggie and snip off the tip to pipe on. ENJOY! ",
      "source": "http://prettypies.com/recipe/red-velvet-cheesecake/"
    },
    {
      "name": {},
      "image": {},
      "id": 9
    },
    {
      "name": {},
      "image": {},
      "id": 10
    },
    {
      "name": {},
      "image": {},
      "id": 11
    },
    {
      "name": {},
      "image": {},
      "id": 12
    },
    {
      "name": {},
      "image": {},
      "id": 13,
      "likes": null
    },
    {
      "name": {},
      "image": {},
      "id": 14
    },
    {
      "name": {},
      "image": {},
      "id": 15
    }
  ]
}